app/controllers/articles_controller.rb

SELECT `articles`.* FROM `articles`
---
  def index
        @articles = Article.all()

INSERT INTO `articles` (`title`, `description`, `created_at`, `updated_at`) VALUES ('sadsad', 'asdddsadds', '2020-08-10 13:10:19', '2020-08-10 13:10:19')
---
  def create
    @article = Article.new(params.require(:article).permit(:title,:description))
			if @article.save

SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 9 LIMIT 1
UPDATE `articles` SET `articles`.`title` = 'introduction - updated', `articles`.`description` = 'learning things step by step - updated', `articles`.`updated_at` = '2020-08-12 22:45:27' WHERE `articles`.`id` = 1
---
	def update
    @article = Article.find(params[:id])
		if @article.update(params.require(:article).permit(:title,:description))